// Адресний простір задається таблицею сторінок (там кожний рядок це атрибути P, R, M і номер фіз. сторінки)
// Спочатку жодна вірт. сторінка не відображена, всі біти P=0. 

class PageTableEntry{
    constructor(){
        // P (presence bit) біт присутності, встановлюється ядром ОС,
        // перевіряється MMU при кожному звертанні. Якщо встановлений,
        // то всі інші атрибути мають сенс.
        this.P = 0; 
        // R (reference bit) біт звертання, скидається ядром, встановлюється
        // MMU. Можливо перевірити чи було звертання до сторінки.
        this.R = 0;
        // M (modification bit) біт модифікації, перевіряється ядром ОС,
        // встановлюється MMU при модифікації даних в сторінці. Можливо
        // перевірити чи модифікована сторінка.
        this.M = 0;
        // PPN (physical page number) номер фізичної сторінки.
        this.PPN = 0;
        this.timeOflastUse = 0;
    }
}


class PageTable{
    
    constructor(){

        this.pages = [];

        
    }

    set(){

    }

    




}

module.exports = PageTable;